//       Реализовать консольное приложение, которое:
//
//        1. Принимает от пользователя и “запоминает” строки.
//        2. Если введено print, выводит строки так, чтобы последняя введенная была первой в списке, а первая - последней.
//        3. Если введено revert, удаляет предыдущую введенную строку из памяти.

package Seminars.S04;

public class Task02
{

//    Scanner sc = new Scanner(System.in);
//    LinkedList<String> st = new LinkedList<>();
//        while (true) {
//    String text = sc.nextLine();
//    if (text.equals("q")) {
//        break;
//    }
//    st.push(text);
//}
//        System.out.println(st);
//
//System.out.println("Введите названия книг, q - для выхода: ");
//
//        while (true) {
//    String book = scanner.nextLine();
//    if ("q".equals(book)) {
//        break;
//    }
//    books.add(book);
//}

//    1. Пусть дан LinkedList с несколькими элементами. Реализуйте метод, который вернет “перевернутый” список.
//    2. Реализуйте очередь с помощью LinkedList со следующими методами:enqueue() - помещает элемент в конец очереди,
//    dequeue() - возвращает первый элемент из очереди и удаляет его, first() - возвращает первый элемент из очереди, не удаляя.
//        3. В калькулятор добавьте возможность отменить последнюю операцию.

}
